10/data/attachments/42b05312bc79aa44.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_869b5a8b-60a8-48aa-87fc-d0ab581a0f9c</nif:username>
            <nif:friendToBeAdded>Abigail_administration_Actions_68996_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>